Reports/РейтингУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>РейтингУслуг</Name>
			<Comment>Рейтинг услуг</Comment>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>Продажи</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выручка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/РейтингУслуг/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура КомандаСформироватьОтчет(Команда)
	Отчет();
КонецПроцедуры     

&НаСервере 
Процедура Отчет()     
	//1. Предварительный этап
	Табдок = ТабличныйДокумент; // указываем тип выходных данных
	ТабДок.Очистить (); // очищаем на случай повторной формировки
	ТабДок.ТолькоПросмотр = Истина;//даем право только на просмотр

//2. Получаем созданный ранее макет с помощью вспомогательной процедуры
	Макет = ПолучитьМакетНаСервере ("Макет") ;

//2.1. Получаем области мажета и выводим их
	ОбластьЗаголовок = Макет.ПолучитьОбласть ("ОбластьЗаголовок") ;
	ТабДок.Вывести(ОбластьЗаголовок) ;

	ОбластьШапка = Макет.ПолучитьОбласть ("ОбластьШапка");
	ТабДок.Вывести(ОбластьШапка);

 
	ОбластьДанные = Макет.ПолучитьОбласть ("ОбластьДанные") ; 
	ОбластьИтоги = Макет.ПолучитьОбласть("ОбластьИтоги");

//2.1.1 Получаем данные для вывода в отчет
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =   
	"ВЫБРАТЬ
	|	спрНоменклатура.Ссылка КАК Услуга,
	|	ПродажиОбороты.ВыручкаОборот КАК Выручка
	|ИЗ
	|	Справочник.Номенклатура КАК спрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ПродажиОбороты
	|		ПО (ПродажиОбороты.Номенклатура = спрНоменклатура.Ссылка)
	|ГДЕ
	|	спрНоменклатура.ЭтоГруппа = ЛОЖЬ
	|	И спрНоменклатура.Родитель В ИЕРАРХИИ(&Группа)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Выручка УБЫВ
	|ИТОГИ
	|	СУММА(Выручка)
	|ПО
	|	ОБЩИЕ"; 
	
//2.1.1.1 Определяем значения параметров запроса
	Группа = Справочники.Номенклатура.НайтиПоНаименованию("Услуги");

	ЗапросДанных.УстановитьПараметр("Группа", Группа);
	ЗапросДанных.УстановитьПараметр("НачалоПериода", Этаформа.НачалоПериода);
	ЗапросДанных.УстановитьПараметр ("КонецПериода", КонецДня(ЭтаФорма.КонецПериода));

//2.1.1.2 Получаем выборку данных
	ВыборкаДанных = ЗапросДанных.Выполнить().Выбрать ();
	ВыборкаОбщийИтог = ЗапросДанных.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
 
//2.1.2 Проводим заполнение данных в цикле
	//2.1.2.1 Пропускаем первую строку результата запроса
		// (в ней содержится значение общего итога)

	ВыборкаДанных.Следующий ();

	//2.1.2.2 Получаем данные выборки и передаем их в нужную область
	Пока ВыборкаДанных.Следующий() Цикл
		ОбластьДанные.Параметры.Услуга = ВыборкаДанных.Услуга;
		ОбластьДанные.Параметры.Выручка = ВыборкаДанных.Выручка;
		ТабДок.Вывести(ОбластьДанные, ВыборкаДанных.Уровень());
	КонецЦикла;

//2.1.3 Проводим вывод итогов
	ВыборкаОбщийИтог.Следующий();
	ОбластьИтоги.Параметры.Выручка = ВыборкаОбщийИтог.Выручка;
	ТабДок.Вывести (ОбластьИтоги) ;
	
	
//3. Заключительный этап - настройка вывода табличного документа

	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.МасштабПечати = 100; // это значит что масштаб будет 100 процентов

	ТабДок.РазмерСтраницы = "A4";
	ТабДок.ТочностьПечати = ТочностьПечати.Точная;

	
КонецПроцедуры


//ВСПОМОГАТЕЛЬНОЕ
&НаСервере
Функция ПолучитьМакетНаСервере(ИмяМакета)
	
	ЭО = РеквизитФормыВЗначение("Отчет");
	Макет = ЭО.ПолучитьМакет(ИмяМакета);
	Возврат Макет;
КонецФункции
